<!DOCTYPE HTML>
             <?php
// вся процедура работает на сесиях. Именно в ней хранятся данные пользователя, пока он находится на сайте. Очень важно запустить их в самом начале странички!!!
session_start();
?>
<html>

<head>
  <title>Экспертная система для выбора места путушествия</title>
</head>

<body>
  <h1> Экспертная система для выбора места путушествия </h1>

       Вы хотите отдыхать в России?


       <input type="checkbox" name="Rus"  value="1">    Да      </td>    <td width=1%> </td>
                <td> <input type="checkbox" name="Rus"  value="0">   Нет   </td>
                                         </tr><tr>


</body>

</html>