<?php

###############################################
###############################################
##///////////////////////////////////////////##
##/////////  "Simple News" v.1.0  ///////////##
##//////////////  by Hast  //////////////////##
##///////////  Mysql Version  ///////////////##
##///////  Copyright © 2008 Hast  ///////////##
##////////  hast4656@gmail.com  /////////////##
##///////////////////////////////////////////##
###############################################
###############################################

session_start();
if (!$_SESSION['admin']) { Header("Location: index.php"); exit; }
$isinclude = true;
include "../dbinit.php";

#############################################################################################################################################
#############################################################################################################################################
     if (isset($_GET['createtable']))
     {                               
         $done = 0;          
	 echo "<hr>";
	 echo "***Log:***<p>";
	                                                                                             
	 $query = "CREATE TABLE `news` (                                                                  
                  `id` INT NOT NULL AUTO_INCREMENT ,
                  `date` VARCHAR( 30 ) NOT NULL ,
                  `text` VARCHAR( 5000 ) NOT NULL , 
                  PRIMARY KEY ( `id` ) 
                  );";
                   
     if (mysql_query($query)) { $done++; echo "*&nbsp;&nbsp;Table created successfull;<br>"; } else { echo "*<font color=\"red\">&nbsp;&nbsp;" . mysql_error() . ";</font><br>"; }
     
     if ($done == 1)
     {
        echo "<font color=\"green\"><b>Done!</b></font><p>***End Of Log***<p>\n"; exit;                             
     }
     else
     {  
	echo "<b>There are errors!</b><p>***End Of Log***<p>\n"; exit;
     } 
     }
#############################################################################################################################################
#############################################################################################################################################     
     if (@$_GET['do'] == "add")
     {
     include "add.php"; exit;
     }
     if (@$_GET['do'] == "edit")
     {
     include "edit.php"; exit;
     }
     if (@$_GET['do'] == "delete")
     {
     include "delete.php"; exit;
     }
#############################################################################################################################################
#############################################################################################################################################
     if (@$_POST)
     {
         $posts_id = $_POST;
	 //print_r($posts_id);
	 foreach($posts_id as $post_id)
         {
	     $query = "DELETE FROM `news` WHERE `id`='$post_id'";
	     if (!mysql_query($query)) echo mysql_error();
	 
	 }
     }
#############################################################################################################################################
#############################################################################################################################################
$date = date("d.m.Y H:i:s");
echo "<center><small>$date</small></center><p>\n";
?>
<html>
<head>
<title>Simple News Админ-Центр</title>
</head>
<body>
<?php
#############################################################################################################################################
#############################################################################################################################################
echo "<center><a href=\"news.php#do=delete_checked\" OnClick=\" if (confirm('Удалить выделенные новости?')) { document.forms['delete_checked'].submit() }\">Удалить отмеченые</a><br>\n";
echo "<center><a href=\"news.php?do=add\">Добавить новость</a><br>\n";
echo "<a href=\"admin.php\">В админку</a></center><p>\n";
#############################################################################################################################################
#############################################################################################################################################
    $query = "SELECT * FROM `news`";
    $result = mysql_query($query);
                                        
    if (!$result)
    {
	  print "<center><img src=\"news.gif\"><br>ошибка:" . mysql_error() . "<br></center>\n";
    }
    elseif (mysql_num_rows($result) == 0)
    {
	 print "<center><img src=\"news.gif\"><br>Новостей нет<br></center>\n";
    }
    else
    {
	 $rows = array();
	 while ($row = mysql_fetch_assoc($result)) 
	 {
	     $rows[]= $row;
	 }
         $rows = array_reverse($rows);
	 echo "<form action=\"{$_SERVER["PHP_SELF"]}\" method=\"POST\" name=\"delete_checked\">\n";
         foreach($rows as $row)
         {                                                                                                                                      
	     print "<center><img src=\"news.gif\"><br>\n<b>{$row['date']}</b><input type=\"checkbox\" name=\"id_{$row['id']}\" value=\"{$row['id']}\"><br>\n{$row['text']}<p>\n<a href=\"news.php?do=delete&new={$row['id']}\" OnClick=\"return confirm('Удалить эту новость?');\">Удалить</a>&nbsp;<a href=\"news.php?do=edit&new={$row['id']}\">Изменить</a></center>\n";    
         }
	 echo "</form>\n";
    }
#############################################################################################################################################
#############################################################################################################################################
?>
</body>
</html>